app/Models/NewsModel.php

    public function getNews($slug = false)
    {
        if ($slug === false) {
            // return $this->findAll();
        }
            $result= $this->findAll();
---
SELECT *
FROM `news`